# Parameter Type Id Array Move To Property

Source: https://www.revitapidocs.com/2026/b6182513-ed3f-c477-8550-cefafee49f07.htm

---

| Parameter Type Id Array Move To Property |
| --- |

"Move To"
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static ForgeTypeId ArrayMoveTo { get; }
```

```
Public Shared ReadOnly Property ArrayMoveTo As ForgeTypeId
	Get
```

```
public:
static property ForgeTypeId^ ArrayMoveTo {
	ForgeTypeId^ get ();
}
```

```
static member ArrayMoveTo : ForgeTypeId with get
```

#### Property Value

ForgeTypeId See Also

#### Reference

ParameterTypeId Class Autodesk.Revit.DB Namespace